---
kind: property
id: P:Autodesk.Revit.DB.GeometryObject.GraphicsStyleId
source: html/4103f148-957e-3f44-9ccd-a5ed6702c689.htm
---
# Autodesk.Revit.DB.GeometryObject.GraphicsStyleId Property

The ElementId of the GeometryObject's GraphicsStyle

## Syntax (C#)
```csharp
public ElementId GraphicsStyleId { get; }
```

## Remarks
This property provides the id of the GraphicsStyle assigned to the GeometryObject.
This can be used to find the category of the object.